---
kind: type
id: T:Autodesk.Revit.DB.Structure.CodeCheckingParameterServiceData
source: html/ea7b503e-39d4-6c0c-1504-7c888cb29fe5.htm
---
# Autodesk.Revit.DB.Structure.CodeCheckingParameterServiceData

The data needed by code checking server to perform code checking.

## Syntax (C#)
```csharp
public class CodeCheckingParameterServiceData : IDisposable
```